; TaskSwitchXP Pro 2.0 Russian Language File
; Translated by Alexander Avdonin <alexander@ntwind.com>
;
;

19999="Russian (Русский)"


; Configuration
20000="Настройки TaskSwitchXP Pro 2.0"
20001="ОК"
20002="Отмена"
20003="Применить"

; Filters
20031="Конфигурационные файлы TaskSwitchXP (*.cfg)"


; Pages
20050="Общие"
20051="Внешний вид"
20052="Список задач"
20053="Предпросмотр"
20054="Информация"
20055="\"Горячие\" клавиши"
20056="Исключения"
20057="Дополнительно"
20058="О программе"

; Page descriptions
20070="Общие настройки TaskSwitchXP"
20071="Внешний вид TaskSwitchXP"
20072="Список задач"
20073="Предпросмотр окон"
20074="Информация о задаче"
20075="\"Горячие\" клавиши TaskSwitchXP"
20076="Исключения TaskSwitchXP"
20077="Дополнительные настройки TaskSwitchXP"
20078="О программе TaskSwitchXP"


; General page
20100="Язык интерфейса:"
20101="<a id=\"idLang\" href=\"\">Другие переводы...</a>"
20102="Отдельные настройки для каждого пользователя в системе"
20103="Автозапуск TaskSwitchXP при старте системы"
20104="Установить высокий приоритет для TaskSwitchXP"
20105="Проверять запущен ли Ms PowerToy TaskSwitcher"
20106="Иконки в трее:"
20107="Показывать иконку TaskSwitchXP в трее при старте"
20108="Использовать другую иконку:"
20109="Сворачивать окна в трей правой кнопкой мыши"
20110="Не позволять Windows прятать иконки TaskSwitchXP"
20111="Добавлять свёрнутые в трей окна в конец списка Alt-Tab"

20120="По умолчанию"
20121="Загрузить..."
20122="Сохранить..."

; Appearance page
20200="Положение на экране:"
20201="На активном мониторе"
20202="Включить эффект тени для TaskSwitchXP"
20203="Включить прозрачность для TaskSwitchXP:"
20204="Использовать плавное появление (в мс)"
20205="Использовать плавное исчезновение (в мс)"
20206="Скины TaskSwitchXP:"
20207="Визуальные стили XP:"
20208="Классические стили:"
20209="Всегда использовать классический стиль"
20210="Перевернуть панели слева направо"

20270="Вверху слева"
20271="Вверху по центру"
20272="Вверху справа"
20273="По центру слева"
20274="По центру"
20275="По центру справа"
20276="Внизу слева"
20277="Внизу по центру"
20278="Внизу справа"

20280="Меню \"Пуск\" XP (по умолчанию)"
20281="Стиль Ms PowerToy TaskSwitcher"
20282="Простое окно XP"
20283="Плоский стиль XP"
20284="Стиль закладок XP"
20285="Стиль панели задач XP"

20290="Меню \"Пуск\" (по умолчанию)"
20291="Плоское меню \"Пуск\""


20300="Вид:"
20301="Количество колонок:"
20302="Ширина (в пикселях):"
20303="Количество строк:"
20304="Маленькие значки"
20305="Показывать подсказки для элементов списка"
20306="Изменять курсор при наведении на элемент списка"
20307="Выделять элемент списка под курсором"
20308="Инвертировать колесо прокрутки"
20309="Стиль выделения:"
20310="Рисовать фокус"
20311="Стиль текста и цвета:"
20312="Шрифт:"
20313="Размер:"
20314="Ж"
20315="К"
20316="Цвет:"

20390="Значки"
20391="Список"

20380="Рамка"
20381="Обычный"
20382="Скруглённый"

20370="Текст"
20371="Выбранный текст"
20372="Фон выбранного текста"
20373="Отмеченный текст 1"
20374="Фон отмеченного текста 1"
20375="Отмеченный текст 2"
20376="Фон отмеченного текста 2"


; Preview page
20400="Предварительный просмотр:"
20401="Стиль \"Рабочий стол\""
20402="Стиль \"Окно\""
20403="Отображать панель задач"
20404="Рисовать только верхнее окно приложения"
20405="Не рисовать фон Рабочего стола и рамку (как в v1.0)"
20406="Использовать обои Рабочего стола как фон"
20407="Рисовать рамку вокруг изображения"
20408="Центрировать изображение по вертикали"
20409="Показывать заголовки свёрнутых окон (*)"
20410="Исключать все прозрачные окна (*)"
20411="Ширина области предпросмотра (в пикселях):"
20412="Задержка первого показа (в мс):"
20413="Не кэшировать изображения"
20414="Автоматически обновлять изображения (в мс):"


; Info page
20500="Панель заголовка:"
20501="Шрифт:"
20502="Размер:"
20503="Ж"
20504="К"
20505="Цвет:"
20506="Рисовать тень:"
20507="Глубина:"
20508="Цвет:"
20509="Показывать значок приложения"
20510="Маленькая панель заголовка"
20511="Панель информации:"
20512="Шрифт:"
20513="Размер:"
20514="Ж"
20515="К"
20516="Цвет:"
20517="Рисовать тень:"
20518="Глубина:"
20519="Цвет:"
20520="Высота:"
20521="Формат:"

20590="Пусто"
20591="Только номер задачи"
20592="Идентификатор процесса"
20593="Имя процесса"
20594="Имя процесса [идентификатор]"
20595="Описание программы"

; Hotkeys page
20600="Заменить стандартый Alt-Tab на TaskSwitchXP"
20601="Переключаться между окнами одного приложения по Ctrl+Alt+Tab"
20602="Не прятать TaskSwitchXP при отпускании Alt"
20603="Использовать низкоуровневый метод перехвата Alt-Tab"
20604="Управление TaskSwitchXP:"
20605="Список всех приложений:"
20606="Список окон приложения:"
20607="Настройка TaskSwitchXP:"
20608="Показать/спрятать иконку в трее:"
20609="Закрыть TaskSwitchXP:"
20610="Дополнительные \"горячие\" клавиши:"
20611="Свернуть окно в трей:"
20612="Восстановить из трея:"

; Exclusions page
20700="Добавить..."
20701="Изменить..."
20702="Удалить"

20780="Предварительный просмотр"
20781="Перечисление окон"

20790="Название"
20791="Параметры"

; Advanced page
20800="Заголовки:"
20801="Использовать заголовок главного окна приложения"
20802="Дополнительные настройки интерфейса:"
20803="Не отображать панель заголовка"
20804="Не отображать панель информации"
20805="Действия иконки в трее:"
20806="Контекстное меню:"
20807="Настройка TaskSwitchXP:"
20808="Список всех  приложений:"
20809="Список окон приложения:"
20810="Настройки конфигуратора:"
20811="Показывать окно настройки поверх всех окон"
20812="Запоминать положение окна настройки"
20813="Запоминать последнюю страницу"
20814="Запускать TaskSwitchXP при старте/выходе"

20890="Нет"
20891="Левая кнопка мыши"
20892="Двойной щелчок левой"
20893="Средняя кнопка мыши"
20894="Двойной щелчок средней"
20895="Правая кнопка мыши"
20896="Двойной щелчок правой"


; About page
20900="Перевод авторский! Ваши замечания, предложения по переводу или по программе пишите либо на <a id=\"idTranslatorHome\" href=\"http://www.ntwind.com/forum/viewforum.php?f=4\">русском форуме</a>, либо мне на <a id=\"idTranslatorMail\" href=\"mailto:alexander@ntwind.com\">e-mail</a>."


; Exclusions dialog
22000="Исключение TaskSwitchXP"
22001="ОК"
22002="Отмена"
22003="Активные приложения:"
22004="Обновить"
22005="Имя исключения:"
22006="Исключать по:"
22007="Имя процесса:"
22008="Класс окна:"
22009="Заголовок окна:"
22010="Исключать из:"
22011="предварительного просмотра"
22012="перечисления окон"
22013="Включено"

22090=""
22091=">> исключено из предпросмотра"
22092=">> исключено из перечисления"

; Errors
30000="Ошибка конфигуратора TaskSwitchXP"
30002="Невозможно запустить TaskSwitchXP.exe. Проверьте установку программы!"
30003="Невозможно сохранить данные в реестре. Проверьте права доступа!"
30004="Невозможно загрузить настройки из файла."
30005="Невозможно загрузить настройки из файла. Восстановлены значения по умолчанию!"
30006="Невозможно сохранить настройки в файл."

; Hints for exclusion dialog
30100="Не задано имя"
30101="Введите какое-нибудь имя для исключения."
30102="Не заданы параметры"
30103="Определите параметры исключения."
30104="Не задано имя процесса"
30105="Введите имя исключаемого процесса."
30106="Не задан класс окна"
30107="Введите класс исключаемого окна."

30900="Подтверждение TaskSwitchXP"
30901="TaskSwitchXP обнаружил, что в системе активно несколько мониторов.\r\nВключить стиль \"Окно\" для отображения предпросмотра окон со вторичных дисплеев?"


; TaskSwitchXP

; Tray menu
31000="Все приложения..."
31001="Окна активного..."
31002="Настройки..."
31003="Выход"

31020="Быстрые настройки"
31021="Спрятать иконку в трее"
31022="Заменить Alt-Tab"
31023="Использовать Ctrl+Alt+Tab"
31024="Не прятать при отпускании Alt"
31025="Низкоуровневый метод перехвата"
31026="Новое исключение..."

31050="Справка"
31051="Документация"
31052="Домашняя страница"
31053="О программе TaskSwitchXP"

; Tray menu for minimized windows
31090="TSXP: %d прогр."
31091="Восстановить все"
31092="Свернуть все"
31093="Закрыть все"
31094="Восстановить"
31095="Свернуть"
31096="Закрыть"

; List menu
31110="Переключиться"
31111="Свернуть"
31112="Свернуть в трей"
31113="Каскадом"
31114="Сверху вниз"
31115="Слева направо"
31116="Восстановить"
31117="Развернуть"
31118="Закрыть"
31119="Завершить процесс"

; Common menu
31150="Информация о процессе"
31151="Выделить все"
31152="Снять выделение"
31153="Удалить выделенные"
31154="Сортировать по заголовку"
31155="Сортировать по группам"

; Info tip mask
31500="Имя процесса:  %s\r\nИдентификатор:  %u\r\n\r\nОбщее время:  %u:%02u:%02u\r\nВремя ЦП:  %u:%02u:%02u\r\n\r\nИсп. памяти:  %uK\r\nВирт. память:  %uK"
31501="N/A"

; Confirmations
31900="Подтверждение TaskSwitchXP"
31901="TaskSwitchXP уже запущен. Остановить его?"
31902="Вы уверены, что хотите закрыть TaskSwitchXP?"
31903="TaskSwitchXP обнаружил, что запущен Ms PowerToy TaskSwitcher.\r\nВозможен конфликт... Хотите я убью его сразу?"

; Errors
32000="Ошибка TaskSwitchXP"
32002="Ошибка инициализации данных."
32003="Невозможно использовать низкоуровневый метод перехвата Alt-Tab."
32004="Невозможно зарегистрировать Alt+[Shift]+Tab.\r\nВозможно другая программа уже использует их."
32005="Невозможно зарегистрировать Ctrl+Alt+[Shift]+Tab.\r\nВозможно другая программа уже использует их."
32006="Невозможно запустить ConfigTsXP.exe! Проверьте установку TaskSwitchXP."

32500="Невозможно зарегистрировать \"горячую\" клавишу:\r\n\r\nНазвание: %s\r\nМодификаторы: %02X\r\nКод: %02X"
32501="Закрыть TaskSwitchXP"
32502="Показать спрятать иконку в трее"
32503="Настройка TaskSwitchXP"
32504="Список приложений"
32505="Список окон приложения"
32506="Свернуть окно в трей"
32507="Восстановить из трея"
